## Ejercicio 4

Match searches with bookings
â€¢ For every search in the searches file, find out whether
the search ended up in a booking or not (using the info
in the bookings file). For instance, search and booking
origin and destination should match.

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sn
import bz2
import csv

In [2]:
ls -lrt

total 2032776
-rw-r--r--@ 1 o002629  staff  483188920  7 feb 18:32 searches.csv.bz2
-rw-r--r--@ 1 o002629  staff  554970628  7 feb 18:32 bookings.csv.bz2
-rw-r--r--@ 1 o002629  staff    2485380  7 feb 19:09 data_challenge.pdf
-rw-r--r--  1 o002629  staff       4601  8 feb 19:20 Ejercicio1.ipynb
-rw-r--r--  1 o002629  staff      35917  9 feb 19:08 Ejercicio2.ipynb
-rw-r--r--@ 1 o002629  staff      63535 14 feb 19:36 Ejercicio3.ipynb
-rw-r--r--  1 o002629  staff      17359 14 feb 20:46 Ejercicio 4.ipynb

In [7]:
pd.options.display.max_columns=None
searches_sample=pd.read_csv ("searches.csv.bz2", sep="^", nrows=5000, usecols=["Date","Seg1Date","Origin","Destination"])
searches_sample.head()

         Date Origin Destination    Seg1Date
0  2013-01-01    TXL         AUH  2013-01-26
1  2013-01-01    ATH         MIL  2013-01-04
2  2013-01-01    ICT         SFO  2013-08-02
3  2013-01-01    RNB         ARN  2013-01-02
4  2013-01-01    OSL         MAD  2013-03-22

In [17]:
booking_sample.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 38 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   act_date   5000 non-null   object
 1   source     5000 non-null   object
 2   pos_ctry   5000 non-null   object
 3   pos_iata   5000 non-null   object
 4   pos_oid    5000 non-null   object
 5   rloc       5000 non-null   object
 6   cre_date   5000 non-null   object
 7   duration   5000 non-null   int64
 8   distance   5000 non-null   int64
 9   dep_port   5000 non-null   object
 10  dep_city   5000 non-null   object
 11  dep_ctry   5000 non-null   object
 12  arr_port   5000 non-null   object
 13  arr_city   5000 non-null   object
 14  arr_ctry   5000 non-null   object
 15  lst_port   5000 non-null   object
 16  lst_city   5000 non-null   object
 17  lst_ctry   5000 non-null   object
 18  brd_port   5000 non-null   object
 19  brd_city   5000 non-null   object
 20  brd_ctry   5000 non-null   object
 21  off_port   5000 non-null   object
 22  off_city   5000 non-null   object
 23  off_ctry   5000 non-null   object
 24  mkt_port   5000 non-null   object
 25  mkt_city   5000 non-null   object
 26  mkt_ctry   5000 non-null   object
 27  intl       5000 non-null   int64
 28  route      5000 non-null   object
 29  carrier    5000 non-null   object
 30  bkg_class  5000 non-null   object
 31  cab_class  5000 non-null   object
 32  brd_time   5000 non-null   object
 33  off_time   5000 non-null   object
 34  pax        5000 non-null   int64
 35  year       5000 non-null   int64
 36  month      5000 non-null   int64
 37  oid        5000 non-null   object
dtypes: int64(6), object(32)
memory usage: 1.4+ MB

In [18]:
#6 -> 
booking_sample=pd.read_csv ("bookings.csv.bz2", sep="^", nrows=5000, usecols=[6,9,12,32])
#booking_sample.columns= booking_sample.columns.str.strip()
#booking_sample.columns
booking_sample.head()

   cre_date             dep_port  arr_port  brd_time
0  2013-02-22 00:00:00  ZRH       LHR       2013-03-07 08:50:00
1  2013-03-26 00:00:00  SAL       CLT       2013-04-12 13:04:00
2  2013-03-26 00:00:00  SAL       CLT       2013-07-15 07:00:00
3  2013-03-26 00:00:00  AKL       SVO       2013-04-24 23:59:00
4  2013-03-26 00:00:00  AKL       SVO       2013-05-14 20:15:00

In [19]:
searches_sample.head()

         Date Origin Destination    Seg1Date
0  2013-01-01    TXL         AUH  2013-01-26
1  2013-01-01    ATH         MIL  2013-01-04
2  2013-01-01    ICT         SFO  2013-08-02
3  2013-01-01    RNB         ARN  2013-01-02
4  2013-01-01    OSL         MAD  2013-03-22

In [21]:
booking_sample.isnull().values.any()

False

In [22]:
searches_sample.isnull().values.any()

True

In [28]:
searches_sample_cleaned= searches_sample.dropna(how='any', axis=0)

In [29]:
searches_sample_cleaned.isnull().values.any()

False

In [30]:
searches_sample_cleaned.shape

(4984, 4)

In [31]:
searches_sample.shape

(5000, 4)

In [39]:
booking_sample.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   cre_date             5000 non-null   object
 1   dep_port             5000 non-null   object
 2   arr_port             5000 non-null   object
 3   brd_time             5000 non-null   object
dtypes: object(4)
memory usage: 156.4+ KB

In [44]:
searches_sample.duplicated().sum()

6

In [45]:
booking_sample.duplicated().sum()

1364

In [46]:
booking_sample.shape

(5000, 4)

In [47]:
booking_sample_cleaned=booking_sample.drop_duplicates()

In [48]:
booking_sample_cleaned.shape

(3636, 4)

In [51]:
searches_sample['Origin'].nunique()

702

In [ ]:
searches_sample_cleaned.merge(booking_sample_cleaned, how='left', left_on=[0,1,2], right_on=[0,1,2])